[
    {
        "position": "Senior Python Developer for Crypto Analytics and Blockchain + Social Webs Data Processing",
        "link": "https://spb.hh.ru/vacancy/95999984?query=python&hhtmFrom=vacancy_search_list",
        "company": "Senior Python Developer for Crypto Analytics and Blockchain + Social Webs Data Processing",
        "city": "Москва",
        "salary": "до 5 000 $",
        "description": "Возможность для разработчиков Python: Присоединяйтесь к нашей команде для разработки инновационных крипто-аналитических решений! Формат работы: удаленно, из любой точки мира Занятость: полная Зарплатная вилка: от _ Стек технологий: Python, FastAPI, Flask, Scrapy, Celery, Redis, MongoDB, Elasticsearch, Pydantic, Pillow, Playwright, Selenium, Kubernetes, Docker, а также опыт работы с ML моделями. Обязанности: Написание качественного и идиоматического кода на Python; Рецензирование pull request от других членов команды, отладка сложных проблем; Участие в процессах принятия решений; Поддержка существующих и разработка новых скрейперов; Реализация интеграции внутренних и внешних API; Содействие в распространении лучших практик кодирования и стандартов, разработка решений мирового класса. Требования: Продвинутые навыки работы с Python (4+ года опыта); Опыт работы с фреймворками: Scrapy, Celery; Глубокие знания работы с базами данных Redis, MongoDB, Elasticsearch; Опыт работы с FastAPI/Flask; Английский язык - минимум на среднем уровне, свободный русский будет плюсом; Навыки реверс-инжиниринга на выбор: опыт работы с локальными прокси для перехвата и анализа HTTPS трафика (mitmproxy, Burp Suite, Charles); опыт работы с эмуляторами Android/IOS и перехватом веб-трафика на них; опыт работы с Frida - патчинг/анализ приложений Android/IOS; опыт обхода систем защиты от ботов, таких как Akamai/PerimeterX/Cloudflare. Будет плюсом: Опыт работы с Playwright/Selenium; Опыт работы с ML (машинное обучение); Опыт работы с Kubernetes и Docker; Опыт работы с такими библиотеками Python, как Pydantic, Pillow и др. Дополнительно: В наши планы входит разработка ML модели для анализа больших данных в области криптовалют, а также анализ транзакций в блокчейне Solana. Мы ищем специалистов, готовых принять участие в создании передовых технологических решений в мире криптовалют."
    },
    {
        "position": "Python developer, remote",
        "link": "https://spb.hh.ru/vacancy/94996622?query=python&hhtmFrom=vacancy_search_list",
        "company": "Python developer, remote",
        "city": "Москва",
        "salary": "2 100 – 2 600 $",
        "description": "Axiom specializes in providing outstaffing and recruitment services for the IT, Back Office, Support, and Market Research industries. We have a track record of success in setting up effective remote command channels and executing complex IT projects.Axiom is looking to build an online marketplace platform that will connect buyers and sellers from all over the world. The platform will feature a wide range of products, from electronics to apparel, and will allow for secure transactions between buyers and sellers. The platform will also include features such as user reviews, seller ratings, and a messaging system for communication between buyers and sellers. Responsibilities: Develop and maintain the online marketplace platform using modern web development technologies such as Python, Django. Work closely with the project manager and stakeholders to understand business requirements and design software solutions that meet those requirements. Write clean, efficient, and maintainable code, following coding standards and best practices. Participate in code reviews, testing, and debugging to ensure that software meets quality standards and is free from bugs and errors. Collaborate with other developers, project managers, and stakeholders to ensure that the platform meets the needs of all users. Keep up to date with the latest trends and technologies in web development and make recommendations for improvements to the platform. Write and maintain technical documentation, including design specifications, user manuals, and system documentation. Requirements: 3+ years of experience in full-stack web development using Python, Django. Experience in designing and building scalable web applications. Strong understanding of database design and SQL. Familiarity with cloud infrastructure services such as AWS. Experience in implementing secure payment systems and integrating with payment gateways. Ability to write clean, efficient, and maintainable code, following coding standards and best practices. Strong collaboration and communication skills. Bachelor's degree in Computer Science, Software Engineering or related field. Fluent English Salary: Salary from $12 up to $15 per hour Working Day: Full-time position, working hours from Monday to Friday (EST business hours) Working Conditions: Fully remote position, based on a contract employment Monthly payments on Payoneer/PayPal/cryptocurrency wallet Holidays and days off can be discussed Please note that you will need to undergo automatic screening on our internal platform, including a Python test and an English language proficiency test."
    },
    {
        "position": "Senior Python/Django разработчик",
        "link": "https://spb.hh.ru/vacancy/94196948?query=python&hhtmFrom=vacancy_search_list",
        "company": "Senior Python/Django разработчик",
        "city": "Москва",
        "salary": "3 200 – 4 000 $",
        "description": "Smart Education – инновационная образовательная компания, которая с помощью AI-помощников предоставляет онлайн-обучение на платформе с LMS. Наша миссия – использовать силу искусственного интеллекта для создания интуитивно понятных и эффективных образовательных инструментов. Обязанности: Принимать активное участие в разработке продуктов компании в команде в качестве backend-разработчика; Разрабатывать новые и поддерживать старые \"фичи\"; Проводить интеграции со сторонними сервисами; Решать сложные, но интересные как технические, так и архитектурные задачи; Требования/ Уверенные знания: Python (строго более 6 лет опыта) Frameworks: Django (более 3 лет опыта + работа с последними версиями) JavaScript, css/sass DB: postgresql, mysql celery, redis vcs: git; docker/docker-compose, ansible; linux (debian, ubuntu); принципы построения REST API; принципы асинхронного программирования; принципы работы микросервисов; тестирование своего кода: Будет плюсом: понимание принципов работы k8s; понимание серверных технологий( в том числе VPN, Proxy), Условия: гибкий старт рабочего дня, свободный график; полностью удаленная работа; молодой дружелюбный коллектив Start-Up, который работает на результат; стабильная работа на долгий срок со стабильной оплатой;"
    }
]